#include "gdef.h"

unsigned long int system_time = 0;
unsigned long int RTC_time_seconds = 0;

static void SetHighExtClock(void);
static void init_timer(void);
static void init_RTC(void);
/*--------------------------------------------------------------------------------*/
void time_init()
{
   SetHighExtClock();
   init_timer();    
   init_RTC();
}
/*--------------------------------------------------------------------------------*/
void time_wait(int t)
{
    unsigned long int tend = system_time + t;
    while(tend > system_time);    
}
/*--------------------------------------------------------------------------------*/
void time_wait_mks(int t)
{
  int i;
  for(i = 0; i < t; i++);
 //   for(j = 0; j < 10; j++);
  
}
/*--------------------------------------------------------------------------------*/
static void SetHighExtClock(void)
{
    BCSCTL1 &= ~XT2OFF;       // Включаем кварцевый генератор 2

    while(1)
    {
        int i;
        
        IFG1 &= ~OFIFG;                // Сброс флага неисправности кварца
        for(i = 0; i < 0x0FFF; i++);   // ждем окончания переходного процесса генератора
        i = 0;
        if((OFIFG & IFG1) == 0) break;   
    }         
    
    // генератор включился
    IE1 |= OFIE;                       // Разрешаем прерывание от неисправности кварца                                                                                       
    BCSCTL2 = 0x9A; //8;               // Переключаем тактирование на кварц     
}  
/*--------------------------------------------------------------------------------*/
static void init_timer(void)
{
    TACTL = MC_0;   // Стоп таймер А
    
    //  настройка первого сравнения
    CCTL0 |= CCIE;    // Разрешение прерывания при совпадении
    CCTL0 &= ~CAP;    // Режим сравнения
    CCR0 = 5530; //11059;     // Опорное значение для сравнения 1ms
    
    TACTL |= TASSEL_2;   // источник тактирования SMCLK
    TACTL |= MC_1;       // пуск таймера А в режиме Up   
}
/*--------------------------------------------------------------------------------
 Настройка сторожевого таймера для часов
--------------------------------------------------------------------------------*/
static void init_RTC(void)
{
/*
    TBCTL = MC_0;   // Стоп таймер B
    
    //  настройка первого сравнения
    TBCCTL0 |= CCIE;    // Разрешение прерывания при совпадении
    TBCCTL0 &= ~CAP;    // Режим сравнения
    TBCCR0 = 32768;     // Опорное значение для сравнения - 1 сек
    
    TBCTL |= TASSEL_1;   // источник тактирования ACLK
    TBCTL |= MC_1;       // пуск таймера B в режиме Up   
*/    

    WDTCTL = WDTPW + WDTTMSEL + WDTSSEL + WDTCNTCL; 
    IE1 |= WDTIE;
}
/*--------------------------------------------------------------------------------
 Прерывание при неисправности генератора
--------------------------------------------------------------------------------*/
#pragma vector = NMI_VECTOR
__interrupt void Fault_Osc (void)
{
    IFG1 &= ~OFIFG;                    
    IE1 |= OFIE;                       
}  
/*--------------------------------------------------------------------------------
 Прерывание сравнения от таймера A блок 0 
--------------------------------------------------------------------------------*/
#pragma vector=TIMERA0_VECTOR
__interrupt void Timer_A (void)
{
  system_time++;
}
/*--------------------------------------------------------------------------------
 Прерывание сравнения от сторожевого таймера
--------------------------------------------------------------------------------*/
#pragma vector=WDT_VECTOR
__interrupt void Timer_RTC (void)
{
  RTC_time_seconds++;
}
/*--------------------------------------------------------------------------------*/

